In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'name' : ['민지','하니','해린','다니엘','혜인'],
                   'english' : [90,80,60,70,50],
                   'math': [50,60,100,20,80]})
df

  name  english  math
0   민지       90    50
1   하니       80    60
2   해린       60   100
3  다니엘       70    20
4   혜인       50    80

In [4]:
df['english']

0    90
1    80
2    60
3    70
4    50
Name: english, dtype: int64

In [6]:
sum(df['english'])

350

In [7]:
sum(df['math'])

310

In [9]:
sum(df['english']) / 5

70.0

In [10]:
sum(df['math']) / 5

62.0

In [11]:
df_2 = pd.DataFrame({'제품' : ['사과','딸기','수박'],
                   '가격' : [1800,1500,3000],
                   '판매량': [24,38,13]})
df_2

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [13]:
sum(df_2['가격']) / 3

2100.0

In [14]:
sum(df_2['판매량']) / 3

25.0